app/controllers/residents_controller.rb

SELECT "residents".* FROM "residents"
---
  def index
    @residents = Resident.all